METRICS = [
        "administration_delay", # ADMISSION_KEYWORDS
        "arrival", # ADMISSION_KEYWORDS
        "bed_room", # ADMISSION_KEYWORDS
        "billing_issues", # ADMISSION_KEYWORDS / DISCHARGE_KEYWORDS
        "cleanliness", # CARE_ON_WARD_KEYWORDS / CARE_ON_WARD_KEYWORDS
        "clinical_delay", # EXAMINATION_DIAGNOSIS_KEYWORDS /
        "communication_scheduling", # OPERATION_KEYWORDS
        "conflicting_or_wrong_diagnosis", #EXAMINATION_DIAGNOSIS_KEYWORDS
        "disagreement_with_discharge", # DISCHARGE_KEYWORDS
        "food", # CARE_ON_WARD_KEYWORDS
        "location", # CARE_ON_WARD_KEYWORDS
        "medical_clinical_errors", # OPERATION_KEYWORDS
        "staff_security_behavior" # CARE_ON_WARD_KEYWORDS
    ]


ADMISSION_KEYWORDS = { ## 1
    "arrival": [
        "حضر", "أحضر", "تم إحضاره",
        "وصل", "وصول",
        "دخل", "دخول",
        "إحضار الطفل",
        "وصلوا إلى المستشفى",
        "حضروا إلى الطوارئ",
        "عند وصوله",
        "على الطوارئ",
        "نقله إلى المستشفى",
    ], ##Done ##reviewed
    "administration": [
        "إجراءات", "إجراءات إدارية",
        "تسجيل الدخول",
        "التأمين", "بطاقة التأمين",
        "انتظار الموافقة", "موافقة التأمين",
        "تأخير في الإجراءات",
        "هيئة",
        "ملف الدخول",
        "ناطر الموافقة",
    ], ##Done
    "financial": [
        "دفع", "دفعي مصاري", "مبلغ",
        "تسديد المبلغ",
        "deposit", "دفعة",
        "مساعدة مالية",
        "رسوم الدخول",
        "فاتورة الدخول",
    ], ##Done
    "bed_room": [
        "عدم توفر سرير",
        "انتظار سرير",
        "انتظار النقل",
        "تأخر في النقل",
        "نقل إلى الغرفة",
        "ما في غرفة",
        "سرير غير متاح",
    ], ##Done
    "waiting_delay": [
        "انتظار", "نطر", "صبر",
        "انتظار طويل",
        "تأخير",
        "انتظر لفترة طويلة",
        "من الصبح",
        "صار الظهر",
    ], ##Done
    "interaction_negative": [
        "طريقة الحكي",
        "غير لائق",
        "عدم التجاوب",
        "تعامل سيء",
        "إستياء",
        "مشكلة مع الموظف",
        "أسلوب غير مناسب",
    ], ##Done
}

CARE_ON_WARD_KEYWORDS = {
    "locations": [
    "غرفة", "غرف", "الرابع", "الثالث", "الpost", "card", "newcard",
    "ccu", "طابق", "جناح", "قسم"
    ], ##Done
    "cleanliness": [
    "عدم نظافة", "وسخة", "متسخة", "غير نظيف", "ما عم تنظف",
    "تنظيف", "تأخر في التنظيف", "ريحة", "روائح", "نفايات"
    ], ##Done (Talk also about the bathroom here)
    "bathroom": [
    "الحمام", "تنظيف الحمام", "ما في محارم", "حمامات", "وسخ الحمام"
    ],  ##Done
    "food": [
    "الطعام", "الأكل", "بارد", "الترويقة", "الوجبة",
    "عدم التنويع", "صحون بلاستيك", "تغليف", "الكباية"
    ], ##Done
    "staff_security_behavior": [
    "موظف الأمن", "منع الدخول", "زيارة", "الصراخ", "النقاش",
    "خارج الغرفة", "بدك تطلع"
    ], ##Done
    "delays": [
    "تأخر", "عم يبطّولوا", "انتظار", "تأخر العاملة"
    ] ##Done
}


DISCHARGE_KEYWORDS = {
    "delay": [
        "تأخير", "تأخرت", "تأخر",
        "انتظار", "نطر", "نتر",
        "ما خلص الملف", "ملف المغادرة",
        "لسا ما نزل", "ما انتهى الملف",
        "من الصبح", "صار الظهر", "ساعات",
        "تأخر إنجاز", "5 ساعات", "7 ساعات",
        "اتأخر الملف"
    ], ##Done
    "billing_issues": [
        "دفع", "مبلغ", "مبالغ",
        "فاتورة", "الفاتورة",
        "حجز الهويات", "حجز هوية",
        "تسديد", "غير مدفوع",
        "فرق الفاتورة",
        "200$", "160$", "3000$", "15000$",
        "Deposit", "دفعة",
        "مشاكل مالية", "تكلفة", "تسعيرة"
    ], ##Done
    "approval_insurance": [
        "موافقة", "جهة ضامنة",
        "لم تتم الموافقة", "تقرير",
        "قوى أمن", "شركة التأمين",
        "لازم موافقة"
    ], ##Done
    "refund_issue": [
        "ما رجعوا", "ما في استرجاع",
        "مش قادرين يرجعوا",
        "رفض استرجاع", "رفض رد المبلغ"
    ],##Done
    "transfer_or_room": [
        "نقل", "تحويل", "ننقل المريضة",
        "غرفة", "درجة أولى",
        "ما أعطونا غرفة", "بجانب الباب",
        "غرفة مفردة", "غرفة خاصة",
        "وعدونا بغرفة"
    ],  ## No Need
    "disagreement_with_discharge": [
        "غير مقتنع", "غير مقتنعين",
        "رفض المغادرة", "رفض الأهل",
        "بدنا نعرف وضعه", "ما فهمنا",
        "ما شرح", "ما وضح",
        "شو صار بحالة المريضة"
    ], ##Done
}

EXAMINATION_DIAGNOSIS_KEYWORDS = {
    "delays": [
    "تأخير", "تأخر", "انتظار", "ما حضر الطبيب",
    "ناطر الدكتور", "ما حدا إجا", "نتيجة متأخرة", "ما رجعوا اتصلوا"
    ], ##Done
    "conflicting_or_wrong_diagnosis": [
    "تشخيص خاطئ", "رأي مخالف", "اختلاف في التشخيص",
    "دكتور قال شي ودكتور قال شي", "تضارب التقرير"
    ], ##Done
    "doctor_not_following_up.json": [
    "ما تابع", "ما حضر يفحص", "ما أجا يشوفه",
    "تركنا بدون متابعة", "ما شرح الحالة"
    ], ##Done
    "lab_and_imaging_issues": [
    "MRI", "echo", "تصوير", "تقرير غير جاهز",
    "CD", "فحوصات مختبر", "إعادة الصورة",
    "فحص غير متوفر", "دفع تكلفة الفحص"
    ], ##Done
    "emergency_action_delays": [
    "الطوارئ", "نزيف", "حالة مستعجلة",
    "لازم ينزل فورًا", "تأخر بإجراء العملية"
    ], ##Done
    "pre_surgery_and_procedure": [
    "قبل العملية", "بنج", "إلغاء الصورة",
    "تجهيزات", "خطأ بالتخطيط"
    ],
    "communication_problems": [
    "ما شرح لنا", "ما خبرونا", "ما أعطونا نتيجة",
    "لازم يشرح للأهل", "ما وضعونا بالصورة", "اتفاجأنا"
    ] ##Done
}

OPERATION_KEYWORDS = {
    "communication_scheduling": [
        "تأخير العملية",
        "تأجيل العملية",
        "عدم إبلاغ بوقت العملية",
        "طول الانتظار",
        "التأخير في التمييل",
        "عدم معرفة وقت الإنزال"
    ], ##Done
    "medical_clinical_errors": [
        "تركيب عدسة خاطئة",
        "أخطاء أثناء العملية",
        "مضاعفات بعد العملية",
        "إهمال طبي",
        "عدوى بعد العملية",
        "خروج المريض قبل التحسن",
        "إجراء خاطئ أثناء الرعاية"
    ], ##Done
    "mismanagement": [
        "عدم توفر الجهاز",
        "نقص الإمكانيات",
        "سوء التنسيق بين الأقسام",
        "عدم وجود الطبيب",
        "إرسال المريض بدون متابعة"
    ],
    "financial_complaints": [
        "عدم توضيح التكلفة",
        "زيادة مفاجئة في الفاتورة"
    ], ##Done
    "patient_experience": [
        "عدم زيارة المريض بعد العملية",
        "شعور بالإهمال",
        "معاملة غير مناسبة"
    ]
}
